### $ leverage terraform apply

```
[14:44:54]    INFO	Attempting to get temporary credentials for apps-devstg account.
[14:45:05]    INFO	Credentials for apps-devstg account written successfully.
[14:45:05]    INFO	Attempting to get temporary credentials for security account.
[14:45:20]    INFO	Credentials for security account written successfully.
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.replication will be created
  + resource "aws_iam_policy" "replication" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "bb-apps-devstg-demo-files-s3-bucket-replication"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetReplicationConfiguration",
                          + "s3:GetObjectVersionForReplication",
                          + "s3:GetObjectVersionAcl",
                          + "s3:GetObjectVersionTagging",
                          + "s3:GetObjectRetention",
                          + "s3:GetObjectLegalHold",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::bb-apps-devstg-demo-files",
                          + "arn:aws:s3:::bb-apps-devstg-demo-files/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "s3:ReplicateObject",
                          + "s3:ReplicateDelete",
                          + "s3:ReplicateTags",
                          + "s3:GetObjectVersionTagging",
                          + "s3:ObjectOwnerOverrideToBucketOwner",
                        ]
                      + Condition = {
                          + StringLikeIfExists = {
                              + "s3:x-amz-server-side-encryption"                = [
                                  + "aws:kms",
                                  + "AES256",
                                ]
                              + "s3:x-amz-server-side-encryption-aws-kms-key-id" = [
                                  + "arn:aws:kms:us-east-2:52XXXXXXXX4:key/c04XXXXXXXXXX-XXXXXXXXfb6e3",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::bb-apps-devstg-demo-files-replica/*"
                    },
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "kms:EncryptionContext:aws:s3:arn" = [
                                  + "arn:aws:s3:::bb-apps-devstg-demo-files/*",
                                ]
                              + "kms:ViaService"                   = "s3.us-east-1.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:kms:us-east-1:52XXXXXXXX4:key/63XXXXXe9-XXXXX-XXXX-XXXXX-cXXXXXXXX61b7",
                        ]
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "kms:EncryptionContext:aws:s3:arn" = [
                                  + "arn:aws:s3:::bb-apps-devstg-demo-files-replica/*",
                                ]
                              + "kms:ViaService"                   = "s3.us-east-2.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:kms:us-east-2:52XXXXXXXX4:key/c04XXXXXXXXXX-XXXXXXXXfb6e3",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy_attachment.replication will be created
  + resource "aws_iam_policy_attachment" "replication" {
      + id         = (known after apply)
      + name       = "bb-apps-devstg-demo-files-s3-bucket-replication"
      + policy_arn = (known after apply)
      + roles      = [
          + "bb-apps-devstg-demo-files-s3-bucket-replication",
        ]
    }

  # aws_iam_role.replication will be created
  + resource "aws_iam_role" "replication" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bb-apps-devstg-demo-files-s3-bucket-replication"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.log_bucket_demo_files.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "bb-apps-devstg-demo-files-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "apps-devstg"
          + "Terraform"   = "true"
        }
      + tags_all                    = {
          + "Environment" = "apps-devstg"
          + "Terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.log_bucket_demo_files.aws_s3_bucket_acl.this[0] will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "log-delivery-write"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.log_bucket_demo_files.aws_s3_bucket_lifecycle_configuration.this[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "billing-objects-logs"
          + status = "Enabled"

          + expiration {
              + days                         = 365
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 180
            }

          + transition {
              + days          = 180
              + storage_class = "GLACIER"
            }
          + transition {
              + days          = 30
              + storage_class = "ONEZONE_IA"
            }
        }
    }

  # module.log_bucket_demo_files.aws_s3_bucket_policy.this[0] will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:*"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = [
                                  + "false",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:s3:::bb-apps-devstg-demo-files-logs/*"
                      + Sid       = "EnforceSSlRequestsOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.log_bucket_demo_files.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.log_bucket_demo_files.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:us-east-1:52XXXXXXXX4:key/63XXXXXe9-XXXXX-XXXX-XXXXX-cXXXXXXXX61b7"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.s3_bucket_demo_files.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "bb-apps-devstg-demo-files"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "apps-devstg"
          + "Terraform"   = "true"
        }
      + tags_all                    = {
          + "Environment" = "apps-devstg"
          + "Terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3_bucket_demo_files.aws_s3_bucket_acl.this[0] will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.s3_bucket_demo_files.aws_s3_bucket_lifecycle_configuration.this[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "billing-objects"
          + status = "Enabled"

          + expiration {
              + days                         = 1825
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 1095
            }

          + transition {
              + days          = 365
              + storage_class = "GLACIER"
            }
          + transition {
              + days          = 90
              + storage_class = "ONEZONE_IA"
            }
        }
    }

  # module.s3_bucket_demo_files.aws_s3_bucket_logging.this[0] will be created
  + resource "aws_s3_bucket_logging" "this" {
      + bucket        = (known after apply)
      + id            = (known after apply)
      + target_bucket = (known after apply)
      + target_prefix = "logs/"
    }

  # module.s3_bucket_demo_files.aws_s3_bucket_policy.this[0] will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + StringEquals = {
                              + "s3:x-amz-acl"                                   = [
                                  + "bucket-owner-full-control",
                                ]
                              + "s3:x-amz-server-side-encryption-aws-kms-key-id" = [
                                  + "arn:aws:kms:us-east-1:52XXXXXXXX4:key/63XXXXXe9-XXXXX-XXXX-XXXXX-cXXXXXXXX61b7",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::900980591242:user/machine.s3.demo"
                        }
                      + Resource  = "arn:aws:s3:::bb-apps-devstg-demo-files/demo/*"
                      + Sid       = "AllowputObjectOwnerFullControlEncyrpted-demo-machine.s3.demo"
                    },
                  + {
                      + Action    = "s3:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::52XXXXXXXX4:role/DevOps"
                        }
                      + Resource  = "arn:aws:s3:::bb-apps-devstg-demo-files/*"
                      + Sid       = "DevOpsRoleFullAccess"
                    },
                  + {
                      + Action    = "s3:*"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = [
                                  + "false",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:s3:::bb-apps-devstg-demo-files/*"
                      + Sid       = "EnforceSSlRequestsOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.s3_bucket_demo_files.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_bucket_demo_files.aws_s3_bucket_replication_configuration.this[0] will be created
  + resource "aws_s3_bucket_replication_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + role   = (known after apply)

      + rule {
          + id     = "ReplicationRule"
          + status = "Enabled"

          + delete_marker_replication {
              + status = "Disabled"
            }

          + destination {
              + account       = "52XXXXXXXX4"
              + bucket        = "arn:aws:s3:::bb-apps-devstg-demo-files-replica"
              + storage_class = "STANDARD"

              + access_control_translation {
                  + owner = "Destination"
                }

              + encryption_configuration {
                  + replica_kms_key_id = "arn:aws:kms:us-east-2:52XXXXXXXX4:key/c04XXXXXXXXXX-XXXXXXXXfb6e3"
                }
            }

          + filter {
            }

          + source_selection_criteria {

              + sse_kms_encrypted_objects {
                  + status = "Enabled"
                }
            }
        }
    }

  # module.s3_bucket_demo_files.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:us-east-1:52XXXXXXXX4:key/63XXXXXe9-XXXXX-XXXX-XXXXX-cXXXXXXXX61b7"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.s3_bucket_demo_files.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.s3_bucket_demo_files_replica.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "bb-apps-devstg-demo-files-replica"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "apps-devstg"
          + "Terraform"   = "true"
        }
      + tags_all                    = {
          + "Environment" = "apps-devstg"
          + "Terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3_bucket_demo_files_replica.aws_s3_bucket_acl.this[0] will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.s3_bucket_demo_files_replica.aws_s3_bucket_lifecycle_configuration.this[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "billing-objects"
          + status = "Enabled"

          + expiration {
              + days                         = 1825
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 1095
            }

          + transition {
              + days          = 365
              + storage_class = "GLACIER"
            }
          + transition {
              + days          = 90
              + storage_class = "ONEZONE_IA"
            }
        }
    }

  # module.s3_bucket_demo_files_replica.aws_s3_bucket_policy.this[0] will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:*"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = [
                                  + "false",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:s3:::bb-apps-devstg-demo-files-replica/*"
                      + Sid       = "EnforceSSlRequestsOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.s3_bucket_demo_files_replica.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_bucket_demo_files_replica.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:us-east-2:52XXXXXXXX4:key/c04XXXXXXXXXX-XXXXXXXXfb6e3"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.s3_bucket_demo_files_replica.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + s3_bucket_demo_files_arn                        = (known after apply)
  + s3_bucket_demo_files_bucket_domain_name         = (known after apply)
  + s3_bucket_demo_files_bucket_log_domain_name     = (known after apply)
  + s3_bucket_demo_files_bucket_replica_domain_name = (known after apply)
  + s3_bucket_demo_files_id                         = (known after apply)
  + s3_bucket_demo_files_log_arn                    = (known after apply)
  + s3_bucket_demo_files_log_id                     = (known after apply)
  + s3_bucket_demo_files_log_region                 = (known after apply)
  + s3_bucket_demo_files_region                     = (known after apply)
  + s3_bucket_demo_files_replica_arn                = (known after apply)
  + s3_bucket_demo_files_replica_id                 = (known after apply)
  + s3_bucket_demo_files_replica_region             = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.s3_bucket_demo_files_replica.aws_s3_bucket.this[0]: Creating...
aws_iam_role.replication: Creating...
module.s3_bucket_demo_files.aws_s3_bucket.this[0]: Creating...
module.log_bucket_demo_files.aws_s3_bucket.this[0]: Creating...
aws_iam_policy.replication: Creating...
aws_iam_policy.replication: Creation complete after 2s [id=arn:aws:iam::52XXXXXXXX4:policy/bb-apps-devstg-demo-files-s3-bucket-replication]
aws_iam_role.replication: Creation complete after 3s [id=bb-apps-devstg-demo-files-s3-bucket-replication]
aws_iam_policy_attachment.replication: Creating...
aws_iam_policy_attachment.replication: Creation complete after 1s [id=bb-apps-devstg-demo-files-s3-bucket-replication]
module.log_bucket_demo_files.aws_s3_bucket.this[0]: Creation complete after 6s [id=bb-apps-devstg-demo-files-logs]
module.s3_bucket_demo_files.aws_s3_bucket.this[0]: Creation complete after 6s [id=bb-apps-devstg-demo-files]
module.log_bucket_demo_files.aws_s3_bucket_policy.this[0]: Creating...
module.log_bucket_demo_files.aws_s3_bucket_server_side_encryption_configuration.this[0]: Creating...
module.s3_bucket_demo_files.aws_s3_bucket_server_side_encryption_configuration.this[0]: Creating...
module.s3_bucket_demo_files.aws_s3_bucket_versioning.this[0]: Creating...
module.log_bucket_demo_files.aws_s3_bucket_acl.this[0]: Creating...
module.s3_bucket_demo_files.aws_s3_bucket_acl.this[0]: Creating...
module.s3_bucket_demo_files.aws_s3_bucket_policy.this[0]: Creating...
module.log_bucket_demo_files.aws_s3_bucket_lifecycle_configuration.this[0]: Creating...
module.s3_bucket_demo_files_replica.aws_s3_bucket.this[0]: Creation complete after 7s [id=bb-apps-devstg-demo-files-replica]
module.s3_bucket_demo_files_replica.aws_s3_bucket_server_side_encryption_configuration.this[0]: Creating...
module.s3_bucket_demo_files_replica.aws_s3_bucket_acl.this[0]: Creating...
module.log_bucket_demo_files.aws_s3_bucket_policy.this[0]: Creation complete after 0s [id=bb-apps-devstg-demo-files-logs]
module.s3_bucket_demo_files_replica.aws_s3_bucket_versioning.this[0]: Creating...
module.s3_bucket_demo_files.aws_s3_bucket_policy.this[0]: Creation complete after 1s [id=bb-apps-devstg-demo-files]
module.s3_bucket_demo_files_replica.aws_s3_bucket_policy.this[0]: Creating...
module.s3_bucket_demo_files.aws_s3_bucket_server_side_encryption_configuration.this[0]: Creation complete after 1s [id=bb-apps-devstg-demo-files]
module.log_bucket_demo_files.aws_s3_bucket_server_side_encryption_configuration.this[0]: Creation complete after 1s [id=bb-apps-devstg-demo-files-logs]
module.log_bucket_demo_files.aws_s3_bucket_public_access_block.this[0]: Creating...
module.s3_bucket_demo_files.aws_s3_bucket_public_access_block.this[0]: Creating...
module.s3_bucket_demo_files.aws_s3_bucket_acl.this[0]: Creation complete after 2s [id=bb-apps-devstg-demo-files,private]
module.log_bucket_demo_files.aws_s3_bucket_acl.this[0]: Creation complete after 2s [id=bb-apps-devstg-demo-files-logs,log-delivery-write]
module.s3_bucket_demo_files_replica.aws_s3_bucket_acl.this[0]: Creation complete after 2s [id=bb-apps-devstg-demo-files-replica,private]
module.s3_bucket_demo_files.aws_s3_bucket_logging.this[0]: Creating...
module.s3_bucket_demo_files_replica.aws_s3_bucket_server_side_encryption_configuration.this[0]: Creation complete after 2s [id=bb-apps-devstg-demo-files-replica]
module.s3_bucket_demo_files.aws_s3_bucket_public_access_block.this[0]: Creation complete after 1s [id=bb-apps-devstg-demo-files]
module.log_bucket_demo_files.aws_s3_bucket_public_access_block.this[0]: Creation complete after 1s [id=bb-apps-devstg-demo-files-logs]
module.s3_bucket_demo_files_replica.aws_s3_bucket_policy.this[0]: Creation complete after 1s [id=bb-apps-devstg-demo-files-replica]
module.s3_bucket_demo_files.aws_s3_bucket_logging.this[0]: Creation complete after 0s [id=bb-apps-devstg-demo-files]
module.s3_bucket_demo_files_replica.aws_s3_bucket_public_access_block.this[0]: Creating...
module.s3_bucket_demo_files_replica.aws_s3_bucket_public_access_block.this[0]: Creation complete after 1s [id=bb-apps-devstg-demo-files-replica]
module.s3_bucket_demo_files.aws_s3_bucket_versioning.this[0]: Creation complete after 3s [id=bb-apps-devstg-demo-files]
module.s3_bucket_demo_files.aws_s3_bucket_replication_configuration.this[0]: Creating...
module.s3_bucket_demo_files.aws_s3_bucket_lifecycle_configuration.this[0]: Creating...
module.s3_bucket_demo_files_replica.aws_s3_bucket_versioning.this[0]: Creation complete after 4s [id=bb-apps-devstg-demo-files-replica]
module.s3_bucket_demo_files_replica.aws_s3_bucket_lifecycle_configuration.this[0]: Creating...
module.s3_bucket_demo_files.aws_s3_bucket_replication_configuration.this[0]: Creation complete after 1s [id=bb-apps-devstg-demo-files]
module.log_bucket_demo_files.aws_s3_bucket_lifecycle_configuration.this[0]: Still creating... [10s elapsed]
module.s3_bucket_demo_files.aws_s3_bucket_lifecycle_configuration.this[0]: Still creating... [10s elapsed]
module.s3_bucket_demo_files_replica.aws_s3_bucket_lifecycle_configuration.this[0]: Still creating... [10s elapsed]
module.log_bucket_demo_files.aws_s3_bucket_lifecycle_configuration.this[0]: Still creating... [20s elapsed]
module.s3_bucket_demo_files.aws_s3_bucket_lifecycle_configuration.this[0]: Still creating... [20s elapsed]
module.s3_bucket_demo_files_replica.aws_s3_bucket_lifecycle_configuration.this[0]: Still creating... [20s elapsed]
module.log_bucket_demo_files.aws_s3_bucket_lifecycle_configuration.this[0]: Still creating... [30s elapsed]
module.s3_bucket_demo_files.aws_s3_bucket_lifecycle_configuration.this[0]: Still creating... [30s elapsed]
module.s3_bucket_demo_files_replica.aws_s3_bucket_lifecycle_configuration.this[0]: Still creating... [30s elapsed]
module.log_bucket_demo_files.aws_s3_bucket_lifecycle_configuration.this[0]: Creation complete after 34s [id=bb-apps-devstg-demo-files-logs]
module.s3_bucket_demo_files_replica.aws_s3_bucket_lifecycle_configuration.this[0]: Creation complete after 32s [id=bb-apps-devstg-demo-files-replica]
module.s3_bucket_demo_files.aws_s3_bucket_lifecycle_configuration.this[0]: Creation complete after 34s [id=bb-apps-devstg-demo-files]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 25 added, 0 changed, 0 destroyed.

Outputs:

s3_bucket_demo_files_arn = "arn:aws:s3:::bb-apps-devstg-demo-files"
s3_bucket_demo_files_bucket_domain_name = "bb-apps-devstg-demo-files.s3.amazonaws.com"
s3_bucket_demo_files_bucket_log_domain_name = "bb-apps-devstg-demo-files-logs.s3.amazonaws.com"
s3_bucket_demo_files_bucket_replica_domain_name = "bb-apps-devstg-demo-files-replica.s3.amazonaws.com"
s3_bucket_demo_files_id = "bb-apps-devstg-demo-files"
s3_bucket_demo_files_log_arn = "arn:aws:s3:::bb-apps-devstg-demo-files-logs"
s3_bucket_demo_files_log_id = "bb-apps-devstg-demo-files-logs"
s3_bucket_demo_files_log_region = "us-east-1"
s3_bucket_demo_files_region = "us-east-1"
s3_bucket_demo_files_replica_arn = "arn:aws:s3:::bb-apps-devstg-demo-files-replica"
s3_bucket_demo_files_replica_id = "bb-apps-devstg-demo-files-replica"
s3_bucket_demo_files_replica_region = "us-east-2"
```
